{
    "name": "The Room of Upside-Down",
    "description": "Gravity holds little sway in this confounding space, where the ceiling might as well be the floor, and walking on what seems solid ground could send adventurers tumbling into the air.",
    "parent_name": "Tombie's Funhouse",
    "lineage": " - name: Tombie's Funhouse\n - purpose: Tombie's Funhouse is designed to challenge the party's perception of reality and test their problem-solving skills in an environment where the whimsical and the dangerous intersect.\n - flavour: The funhouse is an unpredictable labyrinth created by the eccentric wizard Tombie, who delights in the absurd. It's filled with bright colors, distorted mirrors, and bizarre contraptions that seem to defy the laws of physics.\n - secrets: Hidden mechanisms and illusions mask the true nature of the dungeon, with secret passages that can lead to Tombie's private chambers or to hidden treasures.\n - story: Long ago, Tombie was a celebrated mage, known for his extravagant parties. But as his magic delved into realms unknown, his mind became a twisted mirror of his funhouse. Now, he lures adventurers in, promising them glory and riches, if they can survive his twisted games.\n - effect: Players will experience a sense of wonder mixed with trepidation as they navigate the funhouse's deceptive appearances. The environment should encourage exploration but also instill caution, as not everything is as it seems.\n",
    "summary": " - name: The Room of Upside-Down\n - purpose: To disorient and challenge the spatial awareness of the adventurers, forcing them to think in new perspectives to navigate the room.\n - flavour: [\"Upon entering, the adventurers find themselves in a bizarre chamber where the furniture and decor adhere to the ceiling, which is now effectively the floor. The chandeliers, or rather floor-lamps, emit a soft glow that casts eerie shadows across what seems to be the 'sky' overhead. The gravity, however, remains normal for the adventurers, presenting a perplexing puzzle on how to traverse the room.\", 'As the party re-enters, they notice subtle shifts in the placement of the upside-down furniture, as if the room itself is slowly rotating, challenging their previous assumptions and forcing them to re-evaluate their approach.']\n - secrets: Hidden within the room, there is a mechanism that, when activated, aligns the gravity for the adventurers with that of the room's orientation, allowing them to walk on the 'ceiling'.\n - story: This room was a favorite of Tombie's guests during his extravagant parties, serving as a playful test of their wit and agility after they had imbibed his magical concoctions.\n - effect: The players should feel a sense of disorientation and curiosity, pushing them to explore the room's mechanics and overcome the challenge of its inverted nature.\n",
    "context": " - name: Tombie's Funhouse\n - purpose: Tombie's Funhouse is designed to challenge the party's perception of reality and test their problem-solving skills in an environment where the whimsical and the dangerous intersect.\n - flavour: The funhouse is an unpredictable labyrinth created by the eccentric wizard Tombie, who delights in the absurd. It's filled with bright colors, distorted mirrors, and bizarre contraptions that seem to defy the laws of physics.\n - secrets: Hidden mechanisms and illusions mask the true nature of the dungeon, with secret passages that can lead to Tombie's private chambers or to hidden treasures.\n - story: Long ago, Tombie was a celebrated mage, known for his extravagant parties. But as his magic delved into realms unknown, his mind became a twisted mirror of his funhouse. Now, he lures adventurers in, promising them glory and riches, if they can survive his twisted games.\n - effect: Players will experience a sense of wonder mixed with trepidation as they navigate the funhouse's deceptive appearances. The environment should encourage exploration but also instill caution, as not everything is as it seems.\n - name: The Room of Upside-Down\n - purpose: To disorient and challenge the spatial awareness of the adventurers, forcing them to think in new perspectives to navigate the room.\n - flavour: [\"Upon entering, the adventurers find themselves in a bizarre chamber where the furniture and decor adhere to the ceiling, which is now effectively the floor. The chandeliers, or rather floor-lamps, emit a soft glow that casts eerie shadows across what seems to be the 'sky' overhead. The gravity, however, remains normal for the adventurers, presenting a perplexing puzzle on how to traverse the room.\", 'As the party re-enters, they notice subtle shifts in the placement of the upside-down furniture, as if the room itself is slowly rotating, challenging their previous assumptions and forcing them to re-evaluate their approach.']\n - secrets: Hidden within the room, there is a mechanism that, when activated, aligns the gravity for the adventurers with that of the room's orientation, allowing them to walk on the 'ceiling'.\n - story: This room was a favorite of Tombie's guests during his extravagant parties, serving as a playful test of their wit and agility after they had imbibed his magical concoctions.\n - effect: The players should feel a sense of disorientation and curiosity, pushing them to explore the room's mechanics and overcome the challenge of its inverted nature.\n",
    "outline": {
        "purpose": "To disorient and challenge the spatial awareness of the adventurers, forcing them to think in new perspectives to navigate the room.",
        "flavour": [
            "Upon entering, the adventurers find themselves in a bizarre chamber where the furniture and decor adhere to the ceiling, which is now effectively the floor. The chandeliers, or rather floor-lamps, emit a soft glow that casts eerie shadows across what seems to be the 'sky' overhead. The gravity, however, remains normal for the adventurers, presenting a perplexing puzzle on how to traverse the room.",
            "As the party re-enters, they notice subtle shifts in the placement of the upside-down furniture, as if the room itself is slowly rotating, challenging their previous assumptions and forcing them to re-evaluate their approach."
        ],
        "secrets": "Hidden within the room, there is a mechanism that, when activated, aligns the gravity for the adventurers with that of the room's orientation, allowing them to walk on the 'ceiling'.",
        "story": "This room was a favorite of Tombie's guests during his extravagant parties, serving as a playful test of their wit and agility after they had imbibed his magical concoctions.",
        "effect": "The players should feel a sense of disorientation and curiosity, pushing them to explore the room's mechanics and overcome the challenge of its inverted nature.",
        "investigation_text": {
            "0": "The adventurers notice that the upside-down furniture is bolted securely to the ceiling-floor, and there are scratch marks on the walls that suggest movement.",
            "20": "A successful search reveals a hidden lever tucked behind a painting on the ceiling-floor, which seems to control the room's gravitational orientation."
        },
        "perception_text": {
            "0": "The players can easily spot the shimmering portal on the ceiling, as its glow is quite distinct. However, the door that whispers is less apparent, requiring a closer look to locate.",
            "15": "Upon a closer inspection, players discern a faint, ghostly whispering coming from the corner of the room, leading them to the whispering door.",
            "20": "With keen senses, the adventurers detect a faint outline where the portal meets the ceiling, suggesting a transition point to another area of the funhouse."
        }
    }
}