{
    "name": "The Mirror Maze",
    "description": "In this dizzying chamber, mirrors of all shapes and sizes fragment reality. Some paths lead to dead ends, others loop back on themselves, and a few conceal the way forward.",
    "parent_name": "Tombie's Funhouse",
    "lineage": " - name: Tombie's Funhouse\n - purpose: Tombie's Funhouse is designed to challenge the party's perception of reality and test their problem-solving skills in an environment where the whimsical and the dangerous intersect.\n - flavour: The funhouse is an unpredictable labyrinth created by the eccentric wizard Tombie, who delights in the absurd. It's filled with bright colors, distorted mirrors, and bizarre contraptions that seem to defy the laws of physics.\n - secrets: Hidden mechanisms and illusions mask the true nature of the dungeon, with secret passages that can lead to Tombie's private chambers or to hidden treasures.\n - story: Long ago, Tombie was a celebrated mage, known for his extravagant parties. But as his magic delved into realms unknown, his mind became a twisted mirror of his funhouse. Now, he lures adventurers in, promising them glory and riches, if they can survive his twisted games.\n - effect: Players will experience a sense of wonder mixed with trepidation as they navigate the funhouse's deceptive appearances. The environment should encourage exploration but also instill caution, as not everything is as it seems.\n",
    "summary": " - name: The Mirror Maze\n - purpose: To disorient and challenge the players' senses, testing their ability to navigate and solve puzzles under deceptive conditions.\n - secrets: The maze conceals a hidden lever behind one of the mirrors, which, when activated, reveals a secret passage to Tombie's treasure room.\n - story: Tombie created The Mirror Maze to reflect the chaos of his own mind, forcing adventurers to confront not just the maze, but their own perceptions and doubts.\n - effect: Players should feel a mix of fascination and unease as they try to discern which reflections are real and which are illusions. The maze is designed to turn their confidence against them and to make them second-guess their senses.\n",
    "context": " - name: Tombie's Funhouse\n - purpose: Tombie's Funhouse is designed to challenge the party's perception of reality and test their problem-solving skills in an environment where the whimsical and the dangerous intersect.\n - flavour: The funhouse is an unpredictable labyrinth created by the eccentric wizard Tombie, who delights in the absurd. It's filled with bright colors, distorted mirrors, and bizarre contraptions that seem to defy the laws of physics.\n - secrets: Hidden mechanisms and illusions mask the true nature of the dungeon, with secret passages that can lead to Tombie's private chambers or to hidden treasures.\n - story: Long ago, Tombie was a celebrated mage, known for his extravagant parties. But as his magic delved into realms unknown, his mind became a twisted mirror of his funhouse. Now, he lures adventurers in, promising them glory and riches, if they can survive his twisted games.\n - effect: Players will experience a sense of wonder mixed with trepidation as they navigate the funhouse's deceptive appearances. The environment should encourage exploration but also instill caution, as not everything is as it seems.\n - name: The Mirror Maze\n - purpose: To disorient and challenge the players' senses, testing their ability to navigate and solve puzzles under deceptive conditions.\n - secrets: The maze conceals a hidden lever behind one of the mirrors, which, when activated, reveals a secret passage to Tombie's treasure room.\n - story: Tombie created The Mirror Maze to reflect the chaos of his own mind, forcing adventurers to confront not just the maze, but their own perceptions and doubts.\n - effect: Players should feel a mix of fascination and unease as they try to discern which reflections are real and which are illusions. The maze is designed to turn their confidence against them and to make them second-guess their senses.\n",
    "outline": {
        "purpose": "To disorient and challenge the players' senses, testing their ability to navigate and solve puzzles under deceptive conditions.",
        "entry_text": [
            "As the adventurers step into The Mirror Maze, they find themselves engulfed in a dizzying array of reflections. The walls, ceiling, and floor are all made of polished mirrors, creating an infinite number of pathways. Their own images greet them at every turn, some with subtle differences that suggest other realities. The air is filled with the faint scent of ozone and a soft, continuous humming that seems to resonate from the mirrors themselves.",
            "Entering The Mirror Maze once more, the players notice the reflections have shifted subtly. What was once a left turn might now appear as a right, and images that seemed friendly now have a mischievous glint in their eyes. The humming is louder now, as if the maze itself is alive and aware of their presence."
        ],
        "secrets": "The maze conceals a hidden lever behind one of the mirrors, which, when activated, reveals a secret passage to Tombie's treasure room.",
        "story": "Tombie created The Mirror Maze to reflect the chaos of his own mind, forcing adventurers to confront not just the maze, but their own perceptions and doubts.",
        "effect": "Players should feel a mix of fascination and unease as they try to discern which reflections are real and which are illusions. The maze is designed to turn their confidence against them and to make them second-guess their senses.",
        "investigation_text": {
            "0": "The maze seems to be a normal, albeit complex, arrangement of mirrors. However, a careful observer might notice that some reflections don't match the reality they should be mirroring.",
            "20": "Upon close inspection of the mirrors, the players find that one of the panels depresses slightly under pressure. It appears to be a disguised switch that might activate a hidden mechanism within the maze.",
            "25": "A thorough search uncovers a nearly imperceptible seam in one of the mirror panels, suggesting it may slide open to reveal something behind it."
        },
        "perception_text": {
            "0": "The maze is disorienting, and the reflections make it difficult to distinguish sounds and distances. The humming noise is constant and seems to have no discernible source.",
            "15": "In the midst of the maze, the shimmering portal's faint glow can be seen reflecting off the mirrors, indicating its general direction.",
            "20": "The gentle laughter from the archway of twisting vines is faintly audible, and its reflection can be seen dancing in the distance, marking the exit to The Giggling Garden.",
            "25": "The ghostly whispers from the door that repeats spoken words become more distinct, allowing the players to trace the sound back to its source, revealing the exit to The Hall of Laughter."
        }
    }
}